// 출처: https://school.programmers.co.kr/learn/courses/30/lessons/87389
// 제 설명
// 자연수 n이 매개변수로 주어집니다. n을 x로 나눈 나머지가 1이 되도록 하는 가장 작은 자연수 x를 return 하도록 solution 함수를 완성해주세요. 답이 항상 존재함은 증명될 수 있습니다.
// 제한사항
// 3 ≤ n ≤ 1,000,000
// 입출력 예
// n	result
// 10	3
// 12	11
// 입출력 예 설명
// 입출력 예 #1
// 10을 3으로 나눈 나머지가 1이고, 3보다 작은 자연수 중에서 문제의 조건을 만족하는 수가 없으므로, 3을 return 해야 합니다.
// 입출력 예 #2
// 12를 11로 나눈 나머지가 1이고, 11보다 작은 자연수 중에서 문제의 조건을 만족하는 수가 없으므로, 11을 return 해야 합니다.

// 내 풀이
function solution(n) {
  for (let x = 2; x <= n; x++) {
    if (n % x === 1) {
      return x;
    }
  }
}

// 이번 문제는 쉬운 문제라서 보자마자 풀었다.
// x를 2부터 시작한 이유는 1로 n값을 나누면 무조건 나머지가 0이기 때문에
// 굳이 1부터 시작할 필요가 없어서 2부터 시작하였다.
// 그리고 if문으로 나머지가 1가 나오면 바로 리턴하게 하였다.
// 그러면 가장 작은 수의 나머지가 1인 값을 구할 수 있다.
